Catalogs/ТипыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТипыОплат</Name>
			<Comment>Типы оплат</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>Вид оплаты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект оплаты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатыВРознице</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплатыККТ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатыККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплаты</Name>
			<Comment>Виды оплаты</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаличныйРасчет</Name>
					<Comment>Наличный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Comment>Безналичный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяОплата</Name>
					<Comment>Произвольная оплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОплатыВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыОплатыВРознице</Name>
			<Comment>Типы оплаты в рознице</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Оплата наличными</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
					<Comment>Оплата платежными картами</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Оплата в кредит</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлубнаяКарта</Name>
					<Comment>Оплата клубной картой</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
					<Comment>Оплата талоном/купоном</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетЗаведения</Name>
					<Comment>Оплата за счет заведения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыОплат/Ext/ManagerModule.bsl
// Процедура заполнения преопределенных элементов
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	// Наличные
	ТипыОплатНаличные = Справочники.ТипыОплат.Наличные.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		ТипыОплатНаличные.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет;
		ТипыОплатНаличные.Объект = Перечисления.ТипыОплатыВРознице.Наличные;
	Иначе
		Если обЗначениеНеЗаполнено(ТипыОплатНаличные.ВидОплаты) Тогда
			ТипыОплатНаличные.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыОплатНаличные.Объект) Тогда
			ТипыОплатНаличные.Объект = Перечисления.ТипыОплатыВРознице.Наличные;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = ТипыОплатНаличные.ЭтоНовый();
	Если ТипыОплатНаличные.Модифицированность() Тогда
		Попытка
			ТипыОплатНаличные.Записать();
			Сообщить("Справочник ""ТипыОплат"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ТипыОплатНаличные.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// БезНаличные
	ТипыОплатБезНаличные = Справочники.ТипыОплат.Безналичные.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		ТипыОплатБезНаличные.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		ТипыОплатБезНаличные.Объект = Перечисления.ТипыОплатыВРознице.Безналичные;
	Иначе
		Если обЗначениеНеЗаполнено(ТипыОплатБезНаличные.ВидОплаты) Тогда
			ТипыОплатБезНаличные.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыОплатБезНаличные.Объект) Тогда
			ТипыОплатБезНаличные.Объект = Перечисления.ТипыОплатыВРознице.Безналичные;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = ТипыОплатБезНаличные.ЭтоНовый();
	Если ТипыОплатБезНаличные.Модифицированность() Тогда
		Попытка
			ТипыОплатБезНаличные.Записать();
			Сообщить("Справочник ""ТипыОплат"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ТипыОплатБезНаличные.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Кредит
	ТипыОплатКредит = Справочники.ТипыОплат.Кредит.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		ТипыОплатКредит.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		ТипыОплатКредит.Объект = Перечисления.ТипыОплатыВРознице.Кредит;
	Иначе
		Если обЗначениеНеЗаполнено(ТипыОплатКредит.ВидОплаты) Тогда
			ТипыОплатКредит.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыОплатКредит.Объект) Тогда
			ТипыОплатКредит.Объект = Перечисления.ТипыОплатыВРознице.Кредит;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = ТипыОплатКредит.ЭтоНовый();
	Если ТипыОплатКредит.Модифицированность() Тогда
		Попытка
			ТипыОплатКредит.Записать();
			Сообщить("Справочник ""ТипыОплат"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ТипыОплатКредит.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Талон
	ТипыОплатТалон = Справочники.ТипыОплат.Талон.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		ТипыОплатТалон.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		ТипыОплатТалон.Объект = Перечисления.ТипыОплатыВРознице.Талон;
	Иначе
		Если обЗначениеНеЗаполнено(ТипыОплатТалон.ВидОплаты) Тогда
			ТипыОплатТалон.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыОплатТалон.Объект) Тогда
			ТипыОплатТалон.Объект = Перечисления.ТипыОплатыВРознице.Талон;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = ТипыОплатТалон.ЭтоНовый();
	Если ТипыОплатТалон.Модифицированность() Тогда
		Попытка
			ТипыОплатТалон.Записать();
			Сообщить("Справочник ""ТипыОплат"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ТипыОплатТалон.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Клубная карта
	ТипыОплатКлубнаяКарта = Справочники.ТипыОплат.КлубнаяКарта.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		ТипыОплатКлубнаяКарта.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		ТипыОплатКлубнаяКарта.Объект = Перечисления.ТипыОплатыВРознице.КлубнаяКарта;
	Иначе
		Если обЗначениеНеЗаполнено(ТипыОплатКлубнаяКарта.ВидОплаты) Тогда
			ТипыОплатКлубнаяКарта.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыОплатКлубнаяКарта.Объект) Тогда
			ТипыОплатКлубнаяКарта.Объект = Перечисления.ТипыОплатыВРознице.КлубнаяКарта;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = ТипыОплатКлубнаяКарта.ЭтоНовый();
	Если ТипыОплатКлубнаяКарта.Модифицированность() Тогда
		Попытка
			ТипыОплатКлубнаяКарта.Записать();
			Сообщить("Справочник ""ТипыОплат"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ТипыОплатКлубнаяКарта.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// ЗаСчетЗаведения
	ТипыОплатЗаСчетЗаведения = Справочники.ТипыОплат.ЗаСчетЗаведения.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		ТипыОплатЗаСчетЗаведения.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		ТипыОплатЗаСчетЗаведения.Объект = Перечисления.ТипыОплатыВРознице.ЗаСчетЗаведения;
	Иначе
		Если обЗначениеНеЗаполнено(ТипыОплатЗаСчетЗаведения.ВидОплаты) Тогда
			ТипыОплатЗаСчетЗаведения.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыОплатЗаСчетЗаведения.Объект) Тогда
			ТипыОплатЗаСчетЗаведения.Объект = Перечисления.ТипыОплатыВРознице.ЗаСчетЗаведения;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = ТипыОплатЗаСчетЗаведения.ЭтоНовый();
	Если ТипыОплатЗаСчетЗаведения.Модифицированность() Тогда
		Попытка
			ТипыОплатЗаСчетЗаведения.Записать();
			Сообщить("Справочник ""ТипыОплат"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ТипыОплатЗаСчетЗаведения.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
